____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_6 (Convolution2D)  (None, 38, 158, 8)    224         convolution2d_input_2[0][0]      
____________________________________________________________________________________________________
batchnormalization_7 (BatchNorma (None, 38, 158, 8)    32          convolution2d_6[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 38, 158, 8)    0           batchnormalization_7[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 36, 156, 16)   1168        activation_3[0][0]               
____________________________________________________________________________________________________
batchnormalization_8 (BatchNorma (None, 36, 156, 16)   64          convolution2d_7[0][0]            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 36, 156, 16)   0           batchnormalization_8[0][0]       
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)    (None, 18, 78, 16)    0           activation_4[0][0]               
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 16, 76, 24)    3480        maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
batchnormalization_9 (BatchNorma (None, 16, 76, 24)    96          convolution2d_8[0][0]            
____________________________________________________________________________________________________
prelu_6 (PReLU)                  (None, 16, 76, 24)    29184       batchnormalization_9[0][0]       
____________________________________________________________________________________________________
maxpooling2d_5 (MaxPooling2D)    (None, 8, 38, 24)     0           prelu_6[0][0]                    
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 6, 36, 32)     6944        maxpooling2d_5[0][0]             
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorm (None, 6, 36, 32)     128         convolution2d_9[0][0]            
____________________________________________________________________________________________________
prelu_7 (PReLU)                  (None, 6, 36, 32)     6912        batchnormalization_10[0][0]      
____________________________________________________________________________________________________
maxpooling2d_6 (MaxPooling2D)    (None, 3, 18, 32)     0           prelu_7[0][0]                    
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 1, 16, 64)     18496       maxpooling2d_6[0][0]             
____________________________________________________________________________________________________
batchnormalization_11 (BatchNorm (None, 1, 16, 64)     256         convolution2d_10[0][0]           
____________________________________________________________________________________________________
prelu_8 (PReLU)                  (None, 1, 16, 64)     1024        batchnormalization_11[0][0]      
____________________________________________________________________________________________________
flatten_2 (Flatten)              (None, 1024)          0           prelu_8[0][0]                    
____________________________________________________________________________________________________
dense_4 (Dense)                  (None, 100)           102500      flatten_2[0][0]                  
____________________________________________________________________________________________________
batchnormalization_12 (BatchNorm (None, 100)           400         dense_4[0][0]                    
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 100)           0           batchnormalization_12[0][0]      
____________________________________________________________________________________________________
prelu_9 (PReLU)                  (None, 100)           100         dropout_3[0][0]                  
____________________________________________________________________________________________________
dense_5 (Dense)                  (None, 50)            5050        prelu_9[0][0]                    
____________________________________________________________________________________________________
prelu_10 (PReLU)                 (None, 50)            50          dense_5[0][0]                    
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 50)            0           prelu_10[0][0]                   
____________________________________________________________________________________________________
dense_6 (Dense)                  (None, 1)             51          dropout_4[0][0]                  
====================================================================================================
Total params: 176,159
Trainable params: 175,671
Non-trainable params: 488

